ChibiOS/ChibiOS/os/hal/ports/STM32/STM32L0xx/hal_lld.h
/*
    ChibiOS - Copyright (C) 2006..2015 Giovanni Di Sirio

    Licensed under the Apache License, Version 2.0 (the "License");
    you may not use this file except in compliance with the License.
    You may obtain a copy of the License at

        http://www.apache.org/licenses/LICENSE-2.0

    Unless required by applicable law or agreed to in writing, software
    distributed under the License is distributed on an "AS IS" BASIS,
    WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
    See the License for the specific language governing permissions and
    limitations under the License.
*/

/**
 * @file    STM32L0xx/hal_lld.h
 * @brief   STM32L0xx HAL subsystem low level driver header.
 * @pre     This module requires the following macros to be defined in the
 *          @p board.h file:
 *          - STM32_LSECLK.
 *          - STM32_LSEDRV.
 *          - STM32_LSE_BYPASS (optionally).
 *          - STM32_HSECLK.
 *          - STM32_HSE_BYPASS (optionally).
 *          .
 *          One of the following macros must also be defined:
 *          - STM32L051xx, STM32L052xx, STM32L053xx,
 *            STM32L061xx, STM32L062xx, STM32L063xx for ultra-low-power MCUs.
 *          .
 *
 * @addtogroup HAL
 * @{
 */

#ifndef _HAL_LLD_H_
#define _HAL_LLD_H_

/*
 * Registry definitions.
 */
#include "stm32_registry.h"

/*===========================================================================*/
/* Driver constants.                                                         */
/*===========================================================================*/

/**
 * @name    Platform identification macros
 * @{
 */
#if defined(STM32L051xx) || defined(__DOXYGEN__)
#define PLATFORM_NAME           "STM32L051xx ultra-low-power MCU"

#elif defined(STM32L052xx)
#define PLATFORM_NAME           "STM32L052xx ultra-low-power MCU"

#elif defined(STM32L053xx)
#define PLATFORM_NAME           "STM32L053xx ultra-low-power MCU"

#elif defined(STM32L061xx)
#define PLATFORM_NAME           "STM32L061xx ultra-low-power MCU"

#elif defined(STM32L062xx)
#define PLATFORM_NAME           "STM32L062xx ultra-low-power MCU"

#elif defined(STM32L063xx)
#define PLATFORM_NAME           "STM32L063xx ultra-low-power MCU"

#else
#error "STM32L0xx device not specified"
#endif
/** @} */

/**
 * @name    Internal clock sources
 * @{
 */
#define STM32_HSI16CLK          16000000    /**< 16MHz internal clock.      */
#define STM32_HSI48CLK          48000000    /**< 48MHz internal clock.      */
#define STM32_LSICLK            38000       /**< Low speed internal clock.  */
/** @} */

/**
 * @name    PWR_CR register bits definitions
 * @{
 */
#define STM32_PLS_MASK          (7 << 5)    /**< PLS field mask.            */
#define STM32_PLS_LEV0          (0 << 5)    /**< PVD level 0.               */
#define STM32_PLS_LEV1          (1 << 5)    /**< PVD level 1.               */
#define STM32_PLS_LEV2          (2 << 5)    /**< PVD level 2.               */
#define STM32_PLS_LEV3          (3 << 5)    /**< PVD level 3.               */
#define STM32_PLS_LEV4          (4 << 5)    /**< PVD level 4.               */
#define STM32_PLS_LEV5          (5 << 5)    /**< PVD level 5.               */
#define STM32_PLS_LEV6          (6 << 5)    /**< PVD level 6.               */
#define STM32_PLS_EXT           (7 << 5)    /**< PVD level 7.               */

#define STM32_VOS_MASK          (3 << 11)   /**< VOS field mask.            */
#define STM32_VOS_1P8           (1 << 11)   /**< VOS level 1.8 volts.       */
#define STM32_VOS_1P5           (2 << 11)   /**< VOS level 1.5 volts.       */
#define STM32_VOS_1P2           (3 << 11)   /**< VOS level 1.2 volts.       */
/** @} */

/**
 * @name    RCC_CR register bits definitions
 * @{
 */
#define STM32_RTCPRE_MASK       (3 << 29)   /**< RTCPRE mask.               */
#define STM32_RTCPRE_DIV2       (0 << 29)   /**< HSE divided by 2.          */
#define STM32_RTCPRE_DIV4       (1 << 29)   /**< HSE divided by 4.          */
#define STM32_RTCPRE_DIV8       (2 << 29)   /**< HSE divided by 2.          */
#define STM32_RTCPRE_DIV16      (3 << 29)   /**< HSE divided by 16.         */
/** @} */

/**
 * @name    RCC_CFGR register bits definitions
 * @{
 */
#define STM32_SW_MASK           (3 << 0)   /**< SW field mask.             */
#define STM32_SW_MSI            (0 << 0)    /**< SYSCLK source is MSI.      */
#define STM32_SW_HSI16          (1 << 0)    /**< SYSCLK source is HSI16     */
#define STM32_SW_HSE            (2 << 0)    /**< SYSCLK source is HSE.      */
#define STM32_SW_PLL            (3 << 0)    /**< SYSCLK source is PLL.      */

#define STM32_HPRE_MASK         (15 << 4)   /**< HPRE field mask.           */
#define STM32_HPRE_DIV1         (0 << 4)    /**< SYSCLK divided by 1.       */
#define STM32_HPRE_DIV2         (8 << 4)    /**< SYSCLK divided by 2.       */
#define STM32_HPRE_DIV4         (9 << 4)    /**< SYSCLK divided by 4.       */
#define STM32_HPRE_DIV8         (10 << 4)   /**< SYSCLK divided by 8.       */
#define STM32_HPRE_DIV16        (11 << 4)   /**< SYSCLK divided by 16.      */
#define STM32_HPRE_DIV64        (12 << 4)   /**< SYSCLK divided by 64.      */
#define STM32_HPRE_DIV128       (13 << 4)   /**< SYSCLK divided by 128.     */
#define STM32_HPRE_DIV256       (14 << 4)   /**< SYSCLK divided by 256.     */
#define STM32_HPRE_DIV512       (15 << 4)   /**< SYSCLK divided by 512.     */

#define STM32_PPRE1_MASK        (7 << 8)    /**< PPRE2 field mask.          */
#define STM32_PPRE1_DIV1        (0 << 8)    /**< HCLK divided by 1.         */
#define STM32_PPRE1_DIV2        (4 << 8)    /**< HCLK divided by 2.         */
#define STM32_PPRE1_DIV4        (5 << 8)    /**< HCLK divided by 4.         */
#define STM32_PPRE1_DIV8        (6 << 8)    /**< HCLK divided by 8.         */
#define STM32_PPRE1_DIV16       (7 << 8)    /**< HCLK divided by 16.        */

#define STM32_PPRE2_MASK        (7 << 12)   /**< PPRE2 field mask.          */
#define STM32_PPRE2_DIV1        (0 << 12)   /**< HCLK divided by 1.         */
#define STM32_PPRE2_DIV2        (4 << 12)   /**< HCLK divided by 2.         */
#define STM32_PPRE2_DIV4        (5 << 12)   /**< HCLK divided by 4.         */
#define STM32_PPRE2_DIV8        (6 << 12)   /**< HCLK divided by 8.         */
#define STM32_PPRE2_DIV16       (7 << 12)   /**< HCLK divided by 16.        */

#define STM32_STOPWUCK_MASK     (1 << 15)   /**< PLLDIV field mask.         */
#define STM32_STOPWUCK_MSI      (0 << 15)   /**< MSI is wakeup clock.       */
#define STM32_STOPWUCK_HSI16    (1 << 15)   /**< HSI16 is wakeup clock.     */

#define STM32_PLLSRC_MASK       (1 << 16)   /**< PLLSRC field mask.         */
#define STM32_PLLSRC_HSI16      (0 << 16)   /**< PLL clock source is HSI16. */
#define STM32_PLLSRC_HSE        (1 << 16)   /**< PLL clock source is HSE.   */

